In [1]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### For these exercises you have to use the students table that was created in the notebooks 02, 04 and 06

In [2]:
%%sql
DROP TABLE IF EXISTS mentorship;

 * postgresql://user:***@localhost:5432/postgres
Done.

[]

In [3]:

%%sql
CREATE TABLE mentorship (
    mentor_name TEXT NOT NULL,
    mentee_name TEXT NOT NULL,
    mentee_major TEXT,
    PRIMARY KEY (mentor_name, mentee_name)
);


INSERT INTO mentorship (mentor_name, mentee_name, mentee_major) VALUES
('Alice', 'Bob', 'Economics'),
('Bob', 'Charlie', 'Chemistry'),
('Hannah', 'Diana', 'Computer Science'),
('Grace', 'Mark', 'History'),
('Alice', 'Grace', 'Arts'),
('Frank', 'Ian', 'Biology'),
('Eve', 'Frank', 'Social Work');

 * postgresql://user:***@localhost:5432/postgres
Done.
7 rows affected.

[]

In [4]:
%%sql 
SELECT * FROM students;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(1, 'Alice', 20, 'Computer Science'),
 (2, 'Bob', 22, 'Economics'),
 (3, 'Charlie', 19, 'Chemistry'),
 (4, 'Diana', 21, 'Computer Science'),
 (5, 'Eve', 18, None),
 (6, 'Mark', 25, 'History')]

In [5]:
%%sql
SELECT * FROM alumni;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(7, 'Grace', 2019, 'Arts'),
 (8, 'Hannah', 2021, 'History'),
 (9, 'Ian', 2020, 'Biology'),
 (10, 'Diana', 2023, 'Biology'),
 (11, 'Alice', 2022, 'Civil Engineering'),
 (12, 'Frank', 2020, 'Social Work')]

In [ ]:
%%sql
SELECT * FROM mentorship;

 * postgresql://user:***@localhost:5432/postgres
7 rows affected.

[('Alice', 'Bob', 'Economics'),
 ('Bob', 'Charlie', 'Chemistry'),
 ('Hannah', 'Diana', 'Computer Science'),
 ('Grace', 'Mark', 'History'),
 ('Alice', 'Grace', 'Arts'),
 ('Frank', 'Ian', 'Biology'),
 ('Eve', 'Frank', 'Social Work')]

### 1. Create a CTE cs_students that selects all students majoring in Computer Science. Then select all columns from this CTE.

In [7]:
%%sql
WITH cs_students AS (
    SELECT name, major
    FROM students
    WHERE major = 'Computer Science'
)
SELECT * FROM cs_students;

 * postgresql://user:***@localhost:5432/postgres
2 rows affected.

[('Alice', 'Computer Science'), ('Diana', 'Computer Science')]

### 2. Create a CTE recent_alumni selecting alumni who graduated in or after 2022. Then show their names and graduation year.

In [8]:
%%sql
WITH recent_alumni AS (
    SELECT name, graduation_year
    FROM alumni
    WHERE graduation_year >= 2022
)
SELECT name, graduation_year FROM recent_alumni;

 * postgresql://user:***@localhost:5432/postgres
2 rows affected.

[('Diana', 2023), ('Alice', 2022)]

### 3. Create a CTE major_count that counts how many students are in each major. Then select only majors with more than 1 student.

In [9]:
%%sql
WITH major_count AS (
    SELECT major, COUNT(*) AS major_count
    FROM students
    GROUP BY major
)
SELECT major, major_count
FROM major_count
WHERE major_count > 1;

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[('Computer Science', 2)]

### 4. Create two CTEs: cs_students (students in History or Economics) and cs_alumni (alumni in Biology or Arts). Then select all pairs of student and alumni names.

In [10]:
%%sql
WITH cs_students AS (
    SELECT name
    FROM students
    WHERE major = 'History' or major = 'Economics'
    ),
    cs_alumni AS (
        SELECT name
        FROM alumni
        WHERE major = 'Biology' or major = 'Arts'
    )

SELECT si.name AS cs_student, 
        ai.name AS cs_alumni
FROM cs_students si   
CROSS JOIN cs_alumni ai;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[('Bob', 'Grace'),
 ('Mark', 'Grace'),
 ('Bob', 'Ian'),
 ('Mark', 'Ian'),
 ('Bob', 'Diana'),
 ('Mark', 'Diana')]

### 5. Create a CTE students_age selecting student names and ages. Then select from the CTE and order by age descending.

In [11]:
%%sql
WITH students_age AS(
    SELECT name, age
    FROM students
)
SELECT name, age
FROM students_age
ORDER BY age DESC;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[('Mark', 25),
 ('Bob', 22),
 ('Diana', 21),
 ('Alice', 20),
 ('Charlie', 19),
 ('Eve', 18)]

### 6. Create a CTE student_info that selects students and adds a column age_next_year = age + 1. Then select all columns from the CTE.

In [12]:
%%sql
WITH student_info AS (
    SELECT name, age, age +1 AS age_next_year
    FROM students
)
SELECT * FROM student_info;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[('Alice', 20, 21),
 ('Bob', 22, 23),
 ('Charlie', 19, 20),
 ('Diana', 21, 22),
 ('Eve', 18, 19),
 ('Mark', 25, 26)]

### 7. Create two CTEs: one for all students, one for all alumni, each with name and type columns. Then combine them using UNION ALL to get a full list of names with type.

In [13]:
%%sql
WITH student_type AS(
    SELECT name, 'student' AS type
    FROM students
),
alumni_type AS(
    SELECT name, 'alumnus' as type
    FROM alumni
)
SELECT name, type
FROM student_type
UNION ALL
SELECT name, type
FROM alumni_type;

 * postgresql://user:***@localhost:5432/postgres
12 rows affected.

[('Alice', 'student'),
 ('Bob', 'student'),
 ('Charlie', 'student'),
 ('Diana', 'student'),
 ('Eve', 'student'),
 ('Mark', 'student'),
 ('Grace', 'alumnus'),
 ('Hannah', 'alumnus'),
 ('Ian', 'alumnus'),
 ('Diana', 'alumnus'),
 ('Alice', 'alumnus'),
 ('Frank', 'alumnus')]

### 8. Create a CTE major_count counting students per major. Then select majors where the count is greater than 1.

In [14]:
%%sql
WITH major_count AS(
    SELECT major, COUNT(*) AS number_students
    FROM students
    GROUP BY major
)

SELECT major, number_students
FROM major_count
WHERE number_students > 1

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[('Computer Science', 2)]

### 9. Create a CTE student_alumni_pairs that joins students and alumni on major (full outer join). Then select names and use COALESCE to show a single name column.

In [15]:
%%sql
WITH student_alumni_pairs AS(
    SELECT s.name AS student_name, a.name AS alumni_name, s.major AS student_major, a.major AS alumnus_major
    FROM students s 
    FULL OUTER JOIN alumni a 
    ON s.name = a.name
)
SELECT COALESCE(student_name, alumni_name) AS name
FROM student_alumni_pairs;

 * postgresql://user:***@localhost:5432/postgres
10 rows affected.

[('Grace',),
 ('Hannah',),
 ('Ian',),
 ('Diana',),
 ('Alice',),
 ('Frank',),
 ('Mark',),
 ('Bob',),
 ('Charlie',),
 ('Eve',)]

### 10. Assume we have a mentorship table (mentor_name, mentee_name). Create a recursive CTE to find all mentees of a given mentor including indirect mentees.

Hint: use recursive CTE

In [16]:
%%sql 
SELECT * FROM mentorship;

 * postgresql://user:***@localhost:5432/postgres
7 rows affected.

[('Alice', 'Bob', 'Economics'),
 ('Bob', 'Charlie', 'Chemistry'),
 ('Hannah', 'Diana', 'Computer Science'),
 ('Grace', 'Mark', 'History'),
 ('Alice', 'Grace', 'Arts'),
 ('Frank', 'Ian', 'Biology'),
 ('Eve', 'Frank', 'Social Work')]

In [17]:
%%sql
WITH RECURSIVE all_mentees AS(
    SELECT mentor_name, mentee_name
    FROM mentorship

    UNION ALL

    SELECT am.mentor_name, m.mentee_name
    FROM all_mentees am
    INNER JOIN mentorship m
        ON am.mentee_name = m.mentor_name
)

SELECT *
FROM all_mentees;

 * postgresql://user:***@localhost:5432/postgres
10 rows affected.

[('Alice', 'Bob'),
 ('Bob', 'Charlie'),
 ('Hannah', 'Diana'),
 ('Grace', 'Mark'),
 ('Alice', 'Grace'),
 ('Frank', 'Ian'),
 ('Eve', 'Frank'),
 ('Alice', 'Charlie'),
 ('Alice', 'Mark'),
 ('Eve', 'Ian')]